pmo-dataset/mermaid/27.mmd
graph LR
	classDef endEvent stroke-width:4px
	
	StartNoneEvent_1(("Issue occurs")) --> Manual_2["Inform employer"]
	ExclusiveGateway_2{"Death or serious\ninjury?"} -->|"No"| ExclusiveGateway_5{"X"}
	ExclusiveGateway_2 -->|"Yes"| Manual_6["Inform relatives"]
	Service_2["Notify labor\ninspectorate"] --> ExclusiveGateway_4{"X"}
	ExclusiveGateway_3{"Safety authorities\ninformed?"} -->|"No"| Service_2
	ExclusiveGateway_3 -->|"Yes"| ExclusiveGateway_4
	ParallelGateway_1{"+"} --> ExclusiveGateway_6{"Person insured?"}
	Service_3["Notify insurance"] --> ExclusiveGateway_7{"X"}
	ParallelGateway_1 --> ExclusiveGateway_3
	ExclusiveGateway_4 --> ParallelGateway_2{"+"}
	ExclusiveGateway_7 --> ParallelGateway_2
	ExclusiveGateway_6 -->|"Yes"| Service_3
	Manual_2 --> ExclusiveGateway_1{"Type of event?"}
	ExclusiveGateway_8{"X"} --> EndNoneEvent_1(("Issue resolved")):::endEvent
	ExclusiveGateway_5 --> ExclusiveGateway_8
	ParallelGateway_2 --> ExclusiveGateway_9{"Is the person dead?\n(Death as a result\nof an accident)"}
	ExclusiveGateway_10{"X"} --> ExclusiveGateway_5
	ExclusiveGateway_9 -->|"Yes"| ExclusiveGateway_10
	Manual_3["Stay informed about\nthe person's\ncondition"] --> ExclusiveGateway_11{"Did the person die\nand was insured?"}
	ExclusiveGateway_12{"X"} --> ExclusiveGateway_10
	Service_4["Notify insurance\nabout the death"] --> ExclusiveGateway_12
	ExclusiveGateway_11 -->|"Yes"| Service_4
	Manual_1["Schedule safety\ntraining"] --> ExclusiveGateway_14{"X"}
	ExclusiveGateway_13{"Employee training\nreqired?"} -->|"No"| ExclusiveGateway_14
	ExclusiveGateway_13 -->|"Yes"| Manual_1
	ExclusiveGateway_1 -->|"Event that almost\nled to an accident"| ExclusiveGateway_2
	ExclusiveGateway_14 --> ExclusiveGateway_8
	Service_1["Run diagnostics/find\nproblems"] --> ExclusiveGateway_15{"X"}
	ExclusiveGateway_15 --> Manual_4["Fix the problem"]
	Manual_4 --> ExclusiveGateway_16{"More issues?"}
	ExclusiveGateway_16 -->|"No"| ExclusiveGateway_8
	ExclusiveGateway_16 -->|"Yes"| ExclusiveGateway_15
	ExclusiveGateway_17{"X"} --> Manual_7["Fix the threat"]
	Manual_7 --> ExclusiveGateway_18{"More issues?"}
	ExclusiveGateway_18 -->|"Yes"| ExclusiveGateway_17
	Manual_5["Identify potential\nissues"] --> ExclusiveGateway_17
	ExclusiveGateway_9 -->|"No"| Manual_3
	ExclusiveGateway_1 -->|"Defect in protective\nsystem"| ExclusiveGateway_13
	ExclusiveGateway_6 -->|"No"| ExclusiveGateway_7
	ExclusiveGateway_1 -->|"Accident at work"| Service_1
	ExclusiveGateway_1 -->|"Serious/imminent\nthreat to safety"| Manual_5
	Manual_6 --> ParallelGateway_1
	ExclusiveGateway_18 --> ExclusiveGateway_8
	ExclusiveGateway_11 -->|"No"| ExclusiveGateway_12
