pmo-dataset/variations/graphviz_basic/27.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "Issue occurs" -> "Inform employer";
  "Death or serious injury?" -> "ExclusiveGateway_2" [label="No"];
  "Death or serious injury?" -> "Inform relatives" [label="Yes"];
  "Notify labor inspectorate" -> "ExclusiveGateway_1";
  "Safety authorities informed?" -> "Notify labor inspectorate" [label="No"];
  "Safety authorities informed?" -> "ExclusiveGateway_1" [label="Yes"];
  "ParallelGateway_1" -> "Person insured?";
  "Notify insurance" -> "ExclusiveGateway_3";
  "ParallelGateway_1" -> "Safety authorities informed?";
  "ExclusiveGateway_1" -> "ParallelGateway_2";
  "ExclusiveGateway_3" -> "ParallelGateway_2";
  "Person insured?" -> "Notify insurance" [label="Yes"];
  "Inform employer" -> "Type of event?";
  "ExclusiveGateway_4" -> "Issue resolved";
  "ExclusiveGateway_2" -> "ExclusiveGateway_4";
  "ParallelGateway_2" -> "Is the person dead? (Death as a result of an accident)";
  "ExclusiveGateway_5" -> "ExclusiveGateway_2";
  "Is the person dead? (Death as a result of an accident)" -> "ExclusiveGateway_5" [label="Yes"];
  "Stay informed about the person's condition" -> "Did the person die and was insured?";
  "ExclusiveGateway_6" -> "ExclusiveGateway_5";
  "Notify insurance about the death" -> "ExclusiveGateway_6";
  "Did the person die and was insured?" -> "Notify insurance about the death" [label="Yes"];
  "Schedule safety training" -> "ExclusiveGateway_7";
  "Employee training reqired?" -> "ExclusiveGateway_7" [label="No"];
  "Employee training reqired?" -> "Schedule safety training" [label="Yes"];
  "Type of event?" -> "Death or serious injury?" [label="Event that almost led to an accident"];
  "ExclusiveGateway_7" -> "ExclusiveGateway_4";
  "Run diagnostics/find problems" -> "ExclusiveGateway_8";
  "ExclusiveGateway_8" -> "Fix the problem";
  "Fix the problem" -> "More issues?_1";
  "More issues?_1" -> "ExclusiveGateway_4" [label="No"];
  "More issues?_1" -> "ExclusiveGateway_8" [label="Yes"];
  "ExclusiveGateway_9" -> "Fix the threat";
  "Fix the threat" -> "More issues?_2";
  "More issues?_2" -> "ExclusiveGateway_9" [label="Yes"];
  "Identify potential issues" -> "ExclusiveGateway_9";
  "Is the person dead? (Death as a result of an accident)" -> "Stay informed about the person's condition" [label="No"];
  "Type of event?" -> "Employee training reqired?" [label="Defect in protective system"];
  "Person insured?" -> "ExclusiveGateway_3" [label="No"];
  "Type of event?" -> "Run diagnostics/find problems" [label="Accident at work"];
  "Type of event?" -> "Identify potential issues" [label="Serious/imminent threat to safety"];
  "Inform relatives" -> "ParallelGateway_1";
  "More issues?_2" -> "ExclusiveGateway_4";
  "Did the person die and was insured?" -> "ExclusiveGateway_6" [label="No"];

  "Issue occurs" [shape=circle, label="Issue occurs"];
  "Issue resolved" [shape=circle, label="Issue resolved"];
  "Type of event?" [shape=diamond];
  "Death or serious injury?" [shape=diamond];
  "Safety authorities informed?" [shape=diamond];
  "ExclusiveGateway_1" [shape=diamond, label="X"];
  "ExclusiveGateway_2" [shape=diamond, label="X"];
  "Person insured?" [shape=diamond];
  "ExclusiveGateway_3" [shape=diamond, label="X"];
  "ExclusiveGateway_4" [shape=diamond, label="X"];
  "Is the person dead? (Death as a result of an accident)" [shape=diamond];
  "ExclusiveGateway_5" [shape=diamond, label="X"];
  "Did the person die and was insured?" [shape=diamond];
  "ExclusiveGateway_6" [shape=diamond, label="X"];
  "Employee training reqired?" [shape=diamond];
  "ExclusiveGateway_7" [shape=diamond, label="X"];
  "ExclusiveGateway_8" [shape=diamond, label="X"];
  "More issues?_1" [shape=diamond, label="More issues?"];
  "ExclusiveGateway_9" [shape=diamond, label="X"];
  "More issues?_2" [shape=diamond, label="More issues?"];
  "ParallelGateway_1" [shape=diamond, label="+"];
  "ParallelGateway_2" [shape=diamond, label="+"];
}
